tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "surrealdb/tap"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Parser generator
brew "bison"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Console Matrix
brew "cmatrix"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# Platform built on V8 to build network applications
brew "node@16"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php", restart_service: true, link: false
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Generic syntax highlighter
brew "pygments"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Terminal multiplexer
brew "tmux"
# Minimal, todo.txt-focused editor
brew "todo-txt"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Build, bundle & ship your Rust WASM application to the web
brew "trunk"
# Executes a program periodically, showing output fullscreen
brew "watch"
# SDK
brew "dart-lang/dart/dart", link: false
# Beta SDK
brew "dart-lang/dart/dart-beta"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Android SDK component
cask "android-platform-tools"
# Tools for the Android SDK
cask "android-sdk"
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
