tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "mongodb/brew"
tap "stuartleeks/tap"
tap "surrealdb/tap"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Parser generator
brew "bison"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# OpenType text shaping engine
brew "harfbuzz"
# Library to render SVG files using Cairo
brew "librsvg"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Platform built on V8 to build network applications
brew "node"
# Reference implementation for the Development Containers specification
brew "devcontainer"
# Text processing system for reStructuredText
brew "docutils"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# GNU compiler collection
brew "gcc"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Fast Lexical Analyzer, generates Scanners (tokenizers)
brew "flex"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Manage compile and link flags for libraries
brew "pkg-config"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Rainbows and unicorns in your console!
brew "lolcat"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Database of common MIME types
brew "shared-mime-info"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
